package Moni;

/**
 * @author wuboyu <wuboyu@kuaishou.com>
 * Created on 2023-11-23
 */
public class L957 {
    ////监狱中 8 间牢房排成一排，每间牢房可能被占用或空置。
    ////
    //// 每天，无论牢房是被占用或空置，都会根据以下规则进行变更：
    ////
    ////
    //// 如果一间牢房的两个相邻的房间都被占用或都是空的，那么该牢房就会被占用。
    //// 否则，它就会被空置。
    ////
    ////
    //// 注意：由于监狱中的牢房排成一行，所以行中的第一个和最后一个牢房不存在两个相邻的房间。
    ////
    //// 给你一个整数数组 cells ，用于表示牢房的初始状态：如果第 i 间牢房被占用，则 cell[i]==1，否则 cell[i]==0 。另给你一个整数
    ////n 。
    ////
    //// 请你返回 n 天后监狱的状况（即，按上文描述进行 n 次变更）。
    ////
    ////
    ////
    //// 示例 1：
    ////
    ////
    ////输入：cells = [0,1,0,1,1,0,0,1], n = 7
    ////输出：[0,0,1,1,0,0,0,0]
    ////解释：下表总结了监狱每天的状况：
    ////Day 0: [0, 1, 0, 1, 1, 0, 0, 1]
    ////Day 1: [0, 1, 1, 0, 0, 0, 0, 0]
    ////Day 2: [0, 0, 0, 0, 1, 1, 1, 0]
    ////Day 3: [0, 1, 1, 0, 0, 1, 0, 0]
    ////Day 4: [0, 0, 0, 0, 0, 1, 0, 0]
    ////Day 5: [0, 1, 1, 1, 0, 1, 0, 0]
    ////Day 6: [0, 0, 1, 0, 1, 1, 0, 0]
    ////Day 7: [0, 0, 1, 1, 0, 0, 0, 0]

    //> 2023/11/23 14:33:45
    //解答成功:
    //	执行耗时:0 ms,击败了100.00% 的Java用户
    //	内存消耗:40.8 MB,击败了32.64% 的Java用户

    //怎么找出14天是一个循环是一个问题

    public int[] prisonAfterNDays(int[] cells, int n) {
        for(int i = 1 ; i<=n ;i++){
            int[] temp = new int[8];
            if(i==1){
                temp[0]=temp[7]=0;
            }
            for(int j = 1 ; j<7 ;j++){
                if(cells[j-1]==cells[j+1]){
                    temp[j]=1;
                }else{
                    temp[j]=0;
                }
            }
            cells=temp;
        }
        return cells;
    }
}
